### Introduction To pandas

In [3]:
import pandas as pd

Series is one Dimensional Array like object containing a sequence of values (of similar types of Numpy types) associated array of data labels called index.

In [6]:
Series1 = pd.Series([1,2,3,4,5])
Series1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [9]:
# we get the array representation index object of the Series Via its array and index attributes
Series1.index
# Series1.array

RangeIndex(start=0, stop=5, step=1)

In [16]:
# Desirable to create Series with index identifying each data point with a label.
Series2 =pd.Series([1,2,3,4,5], index= ['a','b','c','d','f'])
print(Series2)
# Series2.index
# Series2[3]
print(Series2[['a', 'b', 'c']])

a    1
b    2
c    3
d    4
f    5
dtype: int64
a    1
b    2
c    3
dtype: int64

In [18]:
Series2[Series2 >2]

c    3
d    4
f    5
dtype: int64

In [19]:
import numpy as np
np.exp(Series2)

a      2.718282
b      7.389056
c     20.085537
d     54.598150
f    148.413159
dtype: float64

Series is a fixed length ordered Dictionary, is a mapping of index values to data values.

In [62]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [63]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [64]:
states = ["California", "Ohio", "Oregon", "Texas"]
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

### isna() function and notna() function used to detect the missing data.

In [65]:
print(pd.isna(obj4))
print(pd.notna(obj4))

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool
California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [51]:
# obj4.isna()
# obj4.notna()

In [66]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [68]:
obj4.name ='Population'
obj4.index.name ='state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: Population, dtype: float64

In [71]:
# A Series index can be alter in place by assignment
Series1
Series1.index = ['Asif', 'Ali', 'bhatti', 'Malka', 'Hans']
Series1

Asif      1
Ali       2
bhatti    3
Malka     4
Hans      5
dtype: int64

In [75]:
data = {'state': ['islamabad', 'islamabad', 'islamabad', 'lahore', 'lahore', 'lahore'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
        
        }
frame =pd.DataFrame(data)
frame

       state  year  pop
0  islamabad  2000  1.5
1  islamabad  2001  1.7
2  islamabad  2002  3.6
3     lahore  2001  2.4
4     lahore  2002  2.9
5     lahore  2003  3.2

In [76]:
# For large dataset head() method select first 5 Rows
frame.head()

       state  year  pop
0  islamabad  2000  1.5
1  islamabad  2001  1.7
2  islamabad  2002  3.6
3     lahore  2001  2.4
4     lahore  2002  2.9

In [77]:
# specify sequence of column
pd.DataFrame(data, columns =['year', 'state', 'pop'])

   year      state  pop
0  2000  islamabad  1.5
1  2001  islamabad  1.7
2  2002  islamabad  3.6
3  2001     lahore  2.4
4  2002     lahore  2.9
5  2003     lahore  3.2

In [83]:
frame2 =pd.DataFrame(data, columns =['year', 'state', 'pop', 'debt'], index =['one', 'two', 'three', 'four', 'five','sex'])
frame2

       year      state  pop debt
one    2000  islamabad  1.5  NaN
two    2001  islamabad  1.7  NaN
three  2002  islamabad  3.6  NaN
four   2001     lahore  2.4  NaN
five   2002     lahore  2.9  NaN
sex    2003     lahore  3.2  NaN

In [84]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [87]:
# a column can be retrive as Series either by dic_like notation
print(frame2['state'])
print(frame2.year)

one      islamabad
two      islamabad
three    islamabad
four        lahore
five        lahore
sex         lahore
Name: state, dtype: object
one      2000
two      2001
three    2002
four     2001
five     2002
sex      2003
Name: year, dtype: int64

In [93]:
# Rows can also be retrieved by position or name with the special loc attribute
frame2.loc['five']

year       2002
state    lahore
pop         2.9
debt        NaN
Name: five, dtype: object

In [97]:
# columns can be modified by assignment. For example, the empty column debt could be assigned with scaler value
frame2['debt'] =16.5
frame2
frame2['debt'] =np.arange(6.)
frame2

       year      state  pop  debt
one    2000  islamabad  1.5   0.0
two    2001  islamabad  1.7   1.0
three  2002  islamabad  3.6   2.0
four   2001     lahore  2.4   3.0
five   2002     lahore  2.9   4.0
sex    2003     lahore  3.2   5.0

when we assigning list or array to column. the value length of array or list must be match length of DataFrame. if we assign a series, its labels will be realigned exactly to the dataframe index, inserting missing values in any index values not present:

In [102]:
val =pd.Series([-1.2, -1.5, -1.7], index =['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year      state  pop  debt
one    2000  islamabad  1.5   NaN
two    2001  islamabad  1.7  -1.2
three  2002  islamabad  3.6   NaN
four   2001     lahore  2.4  -1.5
five   2002     lahore  2.9  -1.7
sex    2003     lahore  3.2   NaN

In [113]:
frame2['eastern'] =frame2.state =='lahore'
frame2

       year      state  pop  debt  eartern  eastern
one    2000  islamabad  1.5   NaN    False    False
two    2001  islamabad  1.7  -1.2    False    False
three  2002  islamabad  3.6   NaN    False    False
four   2001     lahore  2.4  -1.5     True     True
five   2002     lahore  2.9  -1.7     True     True
sex    2003     lahore  3.2   NaN     True     True

In [114]:
# del method
del frame2['eastern']

frame2.columns

Index(['year', 'state', 'pop', 'debt', 'eartern'], dtype='object')

if the nested dict is passed to DataFrame then outer keys passed as column name and inner keys passed row index

In [117]:
pop ={ 'ilamabad': {2000:1.5, 2001:1.7, 2002:3.6},
      'lahore' : {2001: 2.4, 2002: 2.9}
    
}
frame3 =pd.DataFrame(pop)
frame3

      ilamabad  lahore
2000       1.5     NaN
2001       1.7     2.4
2002       3.6     2.9

ote that transposing discards the column data types if the columns do not all have the same data
type, so transposing and then transposing back may result in the previous type information being
lost. The columns become arrays of pure Python objects in this case.

In [118]:
pd.DataFrame(pop, index =[2001, 2002, 2003])

      ilamabad  lahore
2001       1.7     2.4
2002       3.6     2.9
2003       NaN     NaN

DataFrame's to_numpy returns the data contained in the DataFrame as a tow_dimensional ndarray

In [119]:

frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [121]:
frame2.to_numpy()

array([[2000, 'islamabad', 1.5, nan, False],
       [2001, 'islamabad', 1.7, -1.2, False],
       [2002, 'islamabad', 3.6, nan, False],
       [2001, 'lahore', 2.4, -1.5, True],
       [2002, 'lahore', 2.9, -1.7, True],
       [2003, 'lahore', 3.2, nan, True]], dtype=object)

### Index objects
pandas's index objects are responsible for holding the axis labels and other meta data. Any array or other sequence of labels we use.

In [131]:
obj =pd.Series(range(3), index =['a', 'b', 'c'])
index = obj.index
print(index[1:])
print(index[1])

Index(['b', 'c'], dtype='object')
b

In [137]:
labels =pd.Index(np.arange(3))
print(labels)
obj2 =pd.Series([1.5, -2.5, 0], index =labels)
print(obj2)

Int64Index([0, 1, 2], dtype='int64')
0    1.5
1   -2.5
2    0.0
dtype: float64

In [140]:
# Pandas index can contain duplicate labels

dup_labels =pd.Index(['foo', 'foo', 'bar', 'bar'])

dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

##### Essential Functionality
### 1 Reindexing

In [145]:
obj =pd.Series([4.5, 7.2, -5.3, 3.6], index =['d', 'c', 'a', 'b'])
print(obj)
# reindex on Series
obj2 =obj.reindex(['a', 'b', 'c', 'd'])
print(obj2)

d    4.5
c    7.2
a   -5.3
b    3.6
dtype: float64
a   -5.3
b    3.6
c    7.2
d    4.5
dtype: float64

### ffill method
For ordered data like time series, it may be desirable to do some
interpolation or filling of values when reindexing. The method option
allows us to do this, using a method such as ffill

In [149]:
obj3 =pd.Series(['blue', 'purple', 'yellow'], index =[0, 2, 4])
print(obj3)
obj3.reindex(range(6), method ='ffill')

0      blue
2    purple
4    yellow
dtype: object

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [160]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),index=['a', 'b', 'd'],columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
b     3      4           5
d     6      7           8

In [161]:
# Row can reindex with reindex method
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   3.0    4.0         5.0
c   NaN    NaN         NaN
d   6.0    7.0         8.0

In [162]:
# Column can reindex with reindex() method
state = ['Texas', 'Utah', 'California']

frame.reindex(columns =state)

   Texas  Utah  California
a      1   NaN           2
b      4   NaN           5
d      7   NaN           8

### loc[] method 
reindex by using loc operator and this work when new labels already exist

In [166]:
frame.loc[['d', 'b', 'a'], ['Texas', 'California']]

   Texas  California
d      7           8
b      4           5
a      1           2

In [168]:
obj =pd.DataFrame(np.arange(16).reshape(4, 4), index =['a', 'b', 'c', 'd'], columns =['lahore', 'karachi', 'peshwar', 'pindi'])
obj

   lahore  karachi  peshwar  pindi
a       0        1        2      3
b       4        5        6      7
c       8        9       10     11
d      12       13       14     15

In [170]:
obj.drop('d')
# obj.drop(['a', 'b'])

   lahore  karachi  peshwar  pindi
a       0        1        2      3
b       4        5        6      7
c       8        9       10     11

In [177]:
obj.drop(columns ='pindi')
obj.drop('lahore', axis =1)

#obj.drop(['lahore', 'karachi'], axis ='columns' inplace =True)
# inplace  manipulate object in_place without returning a new object mean if want to permanent change in present file then if not use then new file create.

   karachi  peshwar  pindi
a        1        2      3
b        5        6      7
c        9       10     11
d       13       14     15

### indexing & slicing and Filtering

In [189]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c','d'])
print(obj['b'])
print(obj[2:5])

print(obj[['a', 'b']])

# Fancy indexing
print(obj[[2, 3]])

1.0
c    2.0
d    3.0
dtype: float64
a    0.0
b    1.0
dtype: float64
c    2.0
d    3.0
dtype: float64

In [190]:
# Select data by label this way, 
obj.loc[['a', 'd']]

a    0.0
d    3.0
dtype: float64

1. Loc operator:
- indexes exclusively with labels.
2. iloc operator
- indexes exclusively with integers to work consistently whether the index contains inter or not

In [193]:
obj.iloc[[0, 1, 2]]

a    0.0
b    1.0
c    2.0
dtype: float64

In [195]:
# this method modifies the corressponding section of the Series
obj.loc['b':'c'] =5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [197]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),index=['Ohio', 'Colorado', 'Utah','New York'],columns=['one', 'two', 'three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [200]:
data['two']
# data[['two', 'three']]
print(data[:2])
print(data[data['three']> 5])

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15